---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Steel.SteelElementProperties
source: html/5befb50e-2135-d83a-01f5-21e3d0fbc515.htm
---
# SteelElementProperties Members

This method adds fabrication information to the given elements.